Repository: gnieark/dc-rest
Catalog: locales/*/main.po
Languages: fr

source: Enable REST API
fr: Activer l'API REST

source: Your API key
fr: Votre clef

source: Your new key is
fr: Votre nouvelle clef est

source: API is open without key
fr: L'API est ouverte sans authentification

source: Rest API configuration
fr: Configuration de l'API

source: If checked, few methods as GET will be allowed to externals users without API key. However, they won't be able to request for non public content.
fr: Si coché, Certaines méthodes seront accessibles sans authentification par clef (ni aucune autre authentification). Cependant, seules les actions et informations normalement accessibles sur le blog par les visiteurs non authentifiés sont concernés.

source: Send Coors headers
fr: Insérer les Headers autorisant les requêtes cross domaine

source: Save configuration
fr: Enregistrer la configuration

source: REST API configuration
fr: Configurer l'API REST JSON

source: Documentation and test interface Swagger UI
fr: Documentation et interface de test de l'API via Swagger UI

source: Your api key has already been created.
fr: Votre clef a déjà été générée

source: Erase existing API key and generate a new one for
fr: Réinitialiser la clef de

source: No API key found.
fr: La clef de l'API n'a pas été initialisée

source: Generate a API key for
fr: Créer une clef pour

source: Copy and paste it, You will cannot see it again.
fr: Copiez collez la. Cette clef ne pourra pas vous être refournie.
